{"class_name": "Sequential", "keras_version": "2.0.9", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "return_state": false, "stateful": false, "implementation": 1, "kernel_constraint": null, "unit_forget_bias": true, "batch_input_shape": [null, 70, 28], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "trainable": true, "bias_constraint": null, "units": 256, "recurrent_dropout": 0.0, "dropout": 0.0, "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "use_bias": true, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "return_state": false, "stateful": false, "implementation": 1, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "units": 256, "recurrent_dropout": 0.0, "dropout": 0.0, "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "use_bias": true, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "return_state": false, "stateful": false, "implementation": 1, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "units": 256, "recurrent_dropout": 0.0, "dropout": 0.0, "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_3", "use_bias": true, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "return_state": false, "stateful": false, "implementation": 1, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "units": 256, "recurrent_dropout": 0.0, "dropout": 0.0, "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_4", "use_bias": true, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 30, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "softmax"}}], "backend": "tensorflow"}