{"keras_version": "2.0.9", "config": [{"config": {"trainable": true, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "units": 256, "kernel_constraint": null, "activity_regularizer": null, "name": "lstm_1", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "batch_input_shape": [null, 1, 1960], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": true, "return_state": false, "recurrent_constraint": null, "dtype": "float32", "activation": "tanh", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 1, "unit_forget_bias": true, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "units": 256, "kernel_constraint": null, "activity_regularizer": null, "name": "lstm_2", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": true, "implementation": 1, "recurrent_constraint": null, "activation": "tanh", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null, "return_state": false, "unit_forget_bias": true, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "units": 256, "kernel_constraint": null, "activity_regularizer": null, "name": "lstm_3", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": true, "implementation": 1, "recurrent_constraint": null, "activation": "tanh", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null, "return_state": false, "unit_forget_bias": true, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "units": 256, "kernel_constraint": null, "activity_regularizer": null, "name": "lstm_4", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": false, "implementation": 1, "recurrent_constraint": null, "activation": "tanh", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null, "return_state": false, "unit_forget_bias": true, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "use_bias": true, "units": 30, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}